superbusycool/Ti_MSPM0G3507_Car/ti_msp_dl_config.h
/*
 * Copyright (c) 2023, Texas Instruments Incorporated - http://www.ti.com
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

/*
 *  ============ ti_msp_dl_config.h =============
 *  Configured MSPM0 DriverLib module declarations
 *
 *  DO NOT EDIT - This file is generated for the MSPM0G350X
 *  by the SysConfig tool.
 */
#ifndef ti_msp_dl_config_h
#define ti_msp_dl_config_h

#define CONFIG_MSPM0G350X

#if defined(__ti_version__) || defined(__TI_COMPILER_VERSION__)
#define SYSCONFIG_WEAK __attribute__((weak))
#elif defined(__IAR_SYSTEMS_ICC__)
#define SYSCONFIG_WEAK __weak
#elif defined(__GNUC__)
#define SYSCONFIG_WEAK __attribute__((weak))
#endif

#include <ti/devices/msp/msp.h>
#include <ti/driverlib/driverlib.h>
#include <ti/driverlib/m0p/dl_core.h>

#ifdef __cplusplus
extern "C" {
#endif

/*
 *  ======== SYSCFG_DL_init ========
 *  Perform all required MSP DL initialization
 *
 *  This function should be called once at a point before any use of
 *  MSP DL.
 */


/* clang-format off */

#define POWER_STARTUP_DELAY                                                (16)



#define CPUCLK_FREQ                                                     80000000



/* Defines for PWM_AB */
#define PWM_AB_INST                                                        TIMA1
#define PWM_AB_INST_IRQHandler                                  TIMA1_IRQHandler
#define PWM_AB_INST_INT_IRQN                                    (TIMA1_INT_IRQn)
#define PWM_AB_INST_CLK_FREQ                                             2500000
/* GPIO defines for channel 0 */
#define GPIO_PWM_AB_C0_PORT                                                GPIOB
#define GPIO_PWM_AB_C0_PIN                                         DL_GPIO_PIN_2
#define GPIO_PWM_AB_C0_IOMUX                                     (IOMUX_PINCM15)
#define GPIO_PWM_AB_C0_IOMUX_FUNC                    IOMUX_PINCM15_PF_TIMA1_CCP0
#define GPIO_PWM_AB_C0_IDX                                   DL_TIMER_CC_0_INDEX
/* GPIO defines for channel 1 */
#define GPIO_PWM_AB_C1_PORT                                                GPIOB
#define GPIO_PWM_AB_C1_PIN                                         DL_GPIO_PIN_3
#define GPIO_PWM_AB_C1_IOMUX                                     (IOMUX_PINCM16)
#define GPIO_PWM_AB_C1_IOMUX_FUNC                    IOMUX_PINCM16_PF_TIMA1_CCP1
#define GPIO_PWM_AB_C1_IDX                                   DL_TIMER_CC_1_INDEX



/* Defines for TIMER_0 */
#define TIMER_0_INST                                                     (TIMA0)
#define TIMER_0_INST_IRQHandler                                 TIMA0_IRQHandler
#define TIMER_0_INST_INT_IRQN                                   (TIMA0_INT_IRQn)
#define TIMER_0_INST_LOAD_VALUE                                          (9999U)



/* Defines for UART_0 */
#define UART_0_INST                                                        UART0
#define UART_0_INST_IRQHandler                                  UART0_IRQHandler
#define UART_0_INST_INT_IRQN                                      UART0_INT_IRQn
#define GPIO_UART_0_RX_PORT                                                GPIOA
#define GPIO_UART_0_TX_PORT                                                GPIOA
#define GPIO_UART_0_RX_PIN                                        DL_GPIO_PIN_11
#define GPIO_UART_0_TX_PIN                                        DL_GPIO_PIN_10
#define GPIO_UART_0_IOMUX_RX                                     (IOMUX_PINCM22)
#define GPIO_UART_0_IOMUX_TX                                     (IOMUX_PINCM21)
#define GPIO_UART_0_IOMUX_RX_FUNC                      IOMUX_PINCM22_PF_UART0_RX
#define GPIO_UART_0_IOMUX_TX_FUNC                      IOMUX_PINCM21_PF_UART0_TX
#define UART_0_BAUD_RATE                                                (115200)
#define UART_0_IBRD_4_MHZ_115200_BAUD                                        (2)
#define UART_0_FBRD_4_MHZ_115200_BAUD                                       (11)





/* Port definition for Pin Group GPIO_GRP_0 */
#define GPIO_GRP_0_PORT                                                  (GPIOA)

/* Defines for PIN_KEY1: GPIOA.12 with pinCMx 34 on package pin 27 */
#define GPIO_GRP_0_PIN_KEY1_PIN                                 (DL_GPIO_PIN_12)
#define GPIO_GRP_0_PIN_KEY1_IOMUX                                (IOMUX_PINCM34)
/* Port definition for Pin Group GPIO_sda */
#define GPIO_sda_PORT                                                    (GPIOA)

/* Defines for PIN_0: GPIOA.0 with pinCMx 1 on package pin 1 */
#define GPIO_sda_PIN_0_PIN                                       (DL_GPIO_PIN_0)
#define GPIO_sda_PIN_0_IOMUX                                      (IOMUX_PINCM1)
/* Port definition for Pin Group GPIO_scl */
#define GPIO_scl_PORT                                                    (GPIOA)

/* Defines for PIN_1: GPIOA.1 with pinCMx 2 on package pin 2 */
#define GPIO_scl_PIN_1_PIN                                       (DL_GPIO_PIN_1)
#define GPIO_scl_PIN_1_IOMUX                                      (IOMUX_PINCM2)
/* Defines for AIN1: GPIOB.24 with pinCMx 52 on package pin 42 */
#define MOTOR_AIN1_PORT                                                  (GPIOB)
#define MOTOR_AIN1_PIN                                          (DL_GPIO_PIN_24)
#define MOTOR_AIN1_IOMUX                                         (IOMUX_PINCM52)
/* Defines for AIN2: GPIOA.27 with pinCMx 60 on package pin 47 */
#define MOTOR_AIN2_PORT                                                  (GPIOA)
#define MOTOR_AIN2_PIN                                          (DL_GPIO_PIN_27)
#define MOTOR_AIN2_IOMUX                                         (IOMUX_PINCM60)
/* Defines for BIN1: GPIOA.24 with pinCMx 54 on package pin 44 */
#define MOTOR_BIN1_PORT                                                  (GPIOA)
#define MOTOR_BIN1_PIN                                          (DL_GPIO_PIN_24)
#define MOTOR_BIN1_IOMUX                                         (IOMUX_PINCM54)
/* Defines for BIN2: GPIOA.23 with pinCMx 53 on package pin 43 */
#define MOTOR_BIN2_PORT                                                  (GPIOA)
#define MOTOR_BIN2_PIN                                          (DL_GPIO_PIN_23)
#define MOTOR_BIN2_IOMUX                                         (IOMUX_PINCM53)
/* Defines for PIN_X1: GPIOB.6 with pinCMx 23 on package pin 20 */
#define GPIO_GRP_Detect_PIN_X1_PORT                                      (GPIOB)
#define GPIO_GRP_Detect_PIN_X1_PIN                               (DL_GPIO_PIN_6)
#define GPIO_GRP_Detect_PIN_X1_IOMUX                             (IOMUX_PINCM23)
/* Defines for PIN_X2: GPIOA.9 with pinCMx 20 on package pin 17 */
#define GPIO_GRP_Detect_PIN_X2_PORT                                      (GPIOA)
#define GPIO_GRP_Detect_PIN_X2_PIN                               (DL_GPIO_PIN_9)
#define GPIO_GRP_Detect_PIN_X2_IOMUX                             (IOMUX_PINCM20)
/* Defines for PIN_X3: GPIOA.8 with pinCMx 19 on package pin 16 */
#define GPIO_GRP_Detect_PIN_X3_PORT                                      (GPIOA)
#define GPIO_GRP_Detect_PIN_X3_PIN                               (DL_GPIO_PIN_8)
#define GPIO_GRP_Detect_PIN_X3_IOMUX                             (IOMUX_PINCM19)
/* Defines for PIN_X4: GPIOA.7 with pinCMx 14 on package pin 13 */
#define GPIO_GRP_Detect_PIN_X4_PORT                                      (GPIOA)
#define GPIO_GRP_Detect_PIN_X4_PIN                               (DL_GPIO_PIN_7)
#define GPIO_GRP_Detect_PIN_X4_IOMUX                             (IOMUX_PINCM14)
/* Defines for E1A: GPIOA.25 with pinCMx 55 on package pin 45 */
#define ENCODER_E1A_PORT                                                 (GPIOA)
// pins affected by this interrupt request:["E1A","E1B"]
#define ENCODER_GPIOA_INT_IRQN                                  (GPIOA_INT_IRQn)
#define ENCODER_GPIOA_INT_IIDX                  (DL_INTERRUPT_GROUP1_IIDX_GPIOA)
#define ENCODER_E1A_IIDX                                    (DL_GPIO_IIDX_DIO25)
#define ENCODER_E1A_PIN                                         (DL_GPIO_PIN_25)
#define ENCODER_E1A_IOMUX                                        (IOMUX_PINCM55)
/* Defines for E1B: GPIOA.26 with pinCMx 59 on package pin 46 */
#define ENCODER_E1B_PORT                                                 (GPIOA)
#define ENCODER_E1B_IIDX                                    (DL_GPIO_IIDX_DIO26)
#define ENCODER_E1B_PIN                                         (DL_GPIO_PIN_26)
#define ENCODER_E1B_IOMUX                                        (IOMUX_PINCM59)
/* Defines for E2A: GPIOB.19 with pinCMx 45 on package pin 38 */
#define ENCODER_E2A_PORT                                                 (GPIOB)
// pins affected by this interrupt request:["E2A","E2B"]
#define ENCODER_GPIOB_INT_IRQN                                  (GPIOB_INT_IRQn)
#define ENCODER_GPIOB_INT_IIDX                  (DL_INTERRUPT_GROUP1_IIDX_GPIOB)
#define ENCODER_E2A_IIDX                                    (DL_GPIO_IIDX_DIO19)
#define ENCODER_E2A_PIN                                         (DL_GPIO_PIN_19)
#define ENCODER_E2A_IOMUX                                        (IOMUX_PINCM45)
/* Defines for E2B: GPIOB.20 with pinCMx 48 on package pin 41 */
#define ENCODER_E2B_PORT                                                 (GPIOB)
#define ENCODER_E2B_IIDX                                    (DL_GPIO_IIDX_DIO20)
#define ENCODER_E2B_PIN                                         (DL_GPIO_PIN_20)
#define ENCODER_E2B_IOMUX                                        (IOMUX_PINCM48)
/* Defines for PIN_X5: GPIOA.16 with pinCMx 38 on package pin 31 */
#define GPIO_GRP_Detect_PIN_X5_PORT                                      (GPIOA)
#define GPIO_GRP_Detect_PIN_X5_PIN                              (DL_GPIO_PIN_16)
#define GPIO_GRP_Detect_PIN_X5_IOMUX                             (IOMUX_PINCM38)
/* Defines for PIN_X6: GPIOA.17 with pinCMx 39 on package pin 32 */
#define GPIO_GRP_Detect_PIN_X6_PORT                                      (GPIOA)
#define GPIO_GRP_Detect_PIN_X6_PIN                              (DL_GPIO_PIN_17)
#define GPIO_GRP_Detect_PIN_X6_IOMUX                             (IOMUX_PINCM39)



/* clang-format on */

void SYSCFG_DL_init(void);
void SYSCFG_DL_initPower(void);
void SYSCFG_DL_GPIO_init(void);
void SYSCFG_DL_SYSCTL_init(void);
void SYSCFG_DL_PWM_AB_init(void);
void SYSCFG_DL_TIMER_0_init(void);
void SYSCFG_DL_UART_0_init(void);

void SYSCFG_DL_SYSTICK_init(void);

bool SYSCFG_DL_saveConfiguration(void);
bool SYSCFG_DL_restoreConfiguration(void);

#ifdef __cplusplus
}
#endif

#endif /* ti_msp_dl_config_h */
